import requests
import bs4
import json
from urllib.parse import urlencode, quote_plus, unquote, quote


subway_route = [['1호선', '온수역', '2'], ['1호선', '오류동역', '3'], ['1호선', '개봉역', '2'], ['1호선', '구일역', '2'], ['1호선', '구로역', '3'], ['1호선', '신도림역', '2'], ['1호선', '영등포역', '2'],
                ['1호선', '신길역', '2'], ['1호선', '대방역', '2'], ['1호선', '노량진역', '3'], ['1호선', '용산역', '3'], ['1호선', '남영역', '3'], ['1호선', '서울역', '3'], ['1호선', '시청역', '2'],
                ['1호선', '종각역', '3'], ['1호선', '종로3가역', '1'], ['1호선', '종로5가역', '2'], ['1호선', '동대문역', '2'], ['1호선', '동묘앞역', '1'], ['1호선', '신설동역', '2'],
                ['1호선', '제기동역', '2'], ['1호선', '청량리역', '2'], ['1호선', '회기역', '2'], ['1호선', '외대앞역', '2'], ['1호선', '신이문역', '2'], ['1호선', '석계역', '3'], ['1호선', '광운대역', '2'],
                ['1호선', '월계역', '3'], ['1호선', '녹천역', '2'], ['1호선', '창동역', '2'], ['1호선', '방학역', '3'], ['1호선', '도봉역', '2'], ['1호선', '도봉산역', '2'], ['2호선', '을지로입구역', '2'],
                ['2호선', '을지로3가역', '2'], ['2호선', '을지로4가역', '1'], ['2호선', '동대문역사문화공원역', '2'], ['2호선', '신당역', '2'], ['2호선', '상왕십리역', '2'], ['2호선', '왕십리역', '1'],
                ['2호선', '한양대역', '2'], ['2호선', '뚝섬역', '2'], ['2호선', '성수역', '1'], ['2호선', '건대입구역', '2'], ['2호선', '구의역', '3'], ['2호선', '강변역', '1'], ['2호선', '잠실나루역', '3'],
                ['2호선', '잠실역', '2'], ['2호선', '잠실새내역', '2'], ['2호선', '종합운동장역', '2'], ['2호선', '삼성역', '2'], ['2호선', '선릉역', '2'], ['2호선', '역삼역', '2'], ['2호선', '강남역', '1'],
                ['2호선', '교대역', '2'], ['2호선', '서초역', '2'], ['2호선', '방배역', '2'], ['2호선', '사당역', '3'], ['2호선', '낙성대역', '2'], ['2호선', '서울대입구역', '2'], ['2호선', '봉천역', '2'],
                ['2호선', '신림역', '2'], ['2호선', '신대방역', '2'], ['2호선', '구로디지털단지역', '2'], ['2호선', '대림역', '2'], ['2호선', '신도림역', '3'], ['2호선', '문래역', '2'],
                ['2호선', '영등포구청역', '2'], ['2호선', '당산역', '2'], ['2호선', '합정역', '4'], ['2호선', '홍대입구역', '2'], ['2호선', '신촌역', '2'], ['2호선', '이대역', '2'],
                ['2호선', '아현역', '2'], ['2호선', '충정로역', '2'], ['2호선', '시청역', '3'], ['3호선', '구파발역', '3'], ['3호선', '연신내역', '3'], ['3호선', '불광역', '3'], ['3호선', '녹번역', '2'],
                ['3호선', '홍제역', '2'], ['3호선', '무악재역', '2'], ['3호선', '독립문역', '2'], ['3호선', '경복궁역', '2'], ['3호선', '안국역', '2'], ['3호선', '종로3가역', '2'],
                ['3호선', '을지로3가역', '2'], ['3호선', '충무로역', '1'], ['3호선', '동대입구역', '2'], ['3호선', '약수역', '2'], ['3호선', '금호역', '1'], ['3호선', '옥수역', '2'],
                ['3호선', '압구정역', '2'], ['3호선', '신사역', '3'], ['3호선', '잠원역', '2'], ['3호선', '고속터미널역', '2'], ['3호선', '교대역', '2'], ['3호선', '남부터미널역', '2'],
                ['3호선', '양재역', '3'], ['3호선', '매봉역', '2'], ['3호선', '도곡역', '2'], ['3호선', '대치역', '1'], ['3호선', '학여울역', '2'], ['3호선', '대청역', '2'], ['3호선', '일원역', '2'],
                ['3호선', '수서역', '2'], ['3호선', '가락시장역', '3'], ['3호선', '경찰병원역', '1'], ['3호선', '오금역', '2'], ['4호선', '당고개역', ''], ['4호선', '상계역', '2'], ['4호선', '노원역', '2'],
                ['4호선', '창동역', '2'], ['4호선', '쌍문역', '2'], ['4호선', '수유역', '3'], ['4호선', '미아역', '2'], ['4호선', '미아사거리역', '2'], ['4호선', '길음역', '2'],
                ['4호선', '성신여대입구역', '3'], ['4호선', '한성대입구역', '2'], ['4호선', '혜화역', '2'], ['4호선', '동대문역', '2'], ['4호선', '동대문역사문화공원역', '2'], ['4호선', '충무로역', '2'],
                ['4호선', '명동역', '1'], ['4호선', '회현역', '2'], ['4호선', '서울역', '2'], ['4호선', '숙대입구역', '2'], ['4호선', '삼각지역', '2'], ['4호선', '신용산역', '1'], ['4호선', '이촌역', '2'],
                ['4호선', '동작역', '4'], ['4호선', '총신대입구역', '3'], ['4호선', '사당역', '2'], ['4호선', '남태령역', '3'], ['5호선', '방화역', ''], ['5호선', '개화산역', '2'],
                ['5호선', '김포공항역', '2'], ['5호선', '송정역', '2'], ['5호선', '마곡역', '2'], ['5호선', '발산역', '2'], ['5호선', '우장산역', '2'], ['5호선', '화곡역', '2'], ['5호선', '까치산역', '2'],
                ['5호선', '신정역', '3'], ['5호선', '목동역', '1'], ['5호선', '오목교역', '2'], ['5호선', '양평역', '2'], ['5호선', '영등포구청역', '1'], ['5호선', '영등포시장역', '2'],
                ['5호선', '신길역', '2'], ['5호선', '여의도역', '2'], ['5호선', '여의나루역', '2'], ['5호선', '마포역', '2'], ['5호선', '공덕역', '2'], ['5호선', '애오개역', '2'], ['5호선', '충정로역', '1'],
                ['5호선', '서대문역', '2'], ['5호선', '광화문역', '2'], ['5호선', '종로3가역', '2'], ['5호선', '을지로4가역', '2'], ['5호선', '동대문역사문화공원역', '2'], ['5호선', '청구역', '2'],
                ['5호선', '신금호역', '2'], ['5호선', '행당역', '2'], ['5호선', '왕십리역', '1'], ['5호선', '마장역', '2'], ['5호선', '답십리역', '2'], ['5호선', '장한평역', '2'], ['5호선', '군자역', '3'],
                ['5호선', '아차산역', '1'], ['5호선', '광나루역', '3'], ['5호선', '천호역', '2'], ['5호선', '강동역', '2'], ['5호선', '둔촌동역', '2'], ['5호선', '올림픽공원역', '3'],
                ['5호선', '방이역', '1'], ['5호선', '오금역', '2'], ['5호선', '개롱역', '2'], ['5호선', '거여역', '2'], ['5호선', '마천역', '1'], ['6호선', '신내역', ''], ['6호선', '봉화산역', '5'],
                ['6호선', '화랑대역', '1'], ['6호선', '태릉입구역', '2'], ['6호선', '석계역', '2'], ['6호선', '돌곶이역', '2'], ['6호선', '상월곡역', '2'], ['6호선', '월곡역', '1'],
                ['6호선', '고려대역', '2'], ['6호선', '안암역', '2'], ['6호선', '보문역', '2'], ['6호선', '창신역', '1'], ['6호선', '동묘앞역', '2'], ['6호선', '신당역', '2'], ['6호선', '청구역', '1'],
                ['6호선', '약수역', '2'], ['6호선', '버티고개역', '2'], ['6호선', '한강진역', '2'], ['6호선', '이태원역', '2'], ['6호선', '녹사평역', '1'], ['6호선', '삼각지역', '2'],
                ['6호선', '효창공원앞역', '2'], ['6호선', '공덕역', '2'], ['6호선', '대흥역', '2'], ['6호선', '광흥창역', '2'], ['6호선', '상수역', '2'], ['6호선', '합정역', '2'], ['6호선', '망원역', '1'],
                ['6호선', '마포구청역', '2'], ['6호선', '월드컵경기장역', '2'], ['6호선', '디지털미디어시티역', '2'], ['6호선', '증산역', '2'], ['6호선', '새절역', '1'], ['6호선', '응암역', '2'],
                ['6호선', '역촌역', '2'], ['6호선', '불광역', '2'], ['6호선', '독바위역', '2'], ['6호선', '연신내역', '3'], ['6호선', '구산역', '1'], ['7호선', '도봉산역', '5'], ['7호선', '수락산역', '2'],
                ['7호선', '마들역', '3'], ['7호선', '노원역', '2'], ['7호선', '중계역', '2'], ['7호선', '하계역', '1'], ['7호선', '공릉역', '2'], ['7호선', '태릉입구역', '2'], ['7호선', '먹골역', '2'],
                ['7호선', '중화역', '1'], ['7호선', '상봉역', '3'], ['7호선', '면목역', '1'], ['7호선', '사가정역', '2'], ['7호선', '용마산역', '2'], ['7호선', '중곡역', '1'], ['7호선', '군자역', '2'],
                ['7호선', '어린이대공원역', '2'], ['7호선', '건대입구역', '2'], ['7호선', '뚝섬유원지역', '2'], ['7호선', '청담역', '3'], ['7호선', '강남구청역', '2'], ['7호선', '학동역', '2'],
                ['7호선', '논현역', '2'], ['7호선', '반포역', '1'], ['7호선', '고속터미널역', '2'], ['7호선', '내방역', '3'], ['7호선', '이수역', '2'], ['7호선', '남성역', '2'], ['7호선', '숭실대입구역', '3'],
                ['7호선', '상도역', '2'], ['7호선', '장승배기역', '2'], ['7호선', '신대방삼거리역', '2'], ['7호선', '보라매역', '2'], ['7호선', '신풍역', '2'], ['7호선', '대림역', '2'], ['7호선', '남구로역', '2'],
                ['7호선', '가산디지털단지역', '2'], ['7호선', '철산역', '3'], ['7호선', '광명사거리역', '2'], ['7호선', '천왕역', '2'], ['7호선', '온수역', '3'], ['8호선', '암사역', ''], ['8호선', '천호역', '2'],
                ['8호선', '강동구청역', '2'], ['8호선', '몽촌토성역', '2'], ['8호선', '잠실역', '2'], ['8호선', '석촌역', '3'], ['8호선', '송파역', '1'], ['8호선', '가락시장역', '2'], ['8호선', '문정역', '2'],
                ['8호선', '장지역', '1'], ['8호선', '복정역', '2'], ['9호선', '개화역', ''], ['9호선', '김포공항역', '5'], ['9호선', '공항시장역', '2'], ['9호선', '신방화역', '1'], ['9호선', '마곡나루역', '3'],
                ['9호선', '양천향교역', '2'], ['9호선', '가양역', '5'], ['9호선', '증미역', '2'], ['9호선', '등촌역', '2'], ['9호선', '염창역', '2'], ['9호선', '신목동역', '2'], ['9호선', '선유도역', '2'],
                ['9호선', '당산역', '3'], ['9호선', '국회의사당역', '2'], ['9호선', '여의도역', '2'], ['9호선', '샛강역', '4'], ['9호선', '노량진역', '3'], ['9호선', '노들역', '2'], ['9호선', '흑석역', '2'],
                ['9호선', '동작역', '2'], ['9호선', '구반포역', '3'], ['9호선', '신반포역', '1'], ['9호선', '고속터미널역', '2'], ['9호선', '사평역', '5'], ['9호선', '신논현역', '2'], ['9호선', '언주역', '2'],
                ['9호선', '선정릉역', '2'], ['9호선', '삼성중앙역', '2'], ['9호선', '봉은사역', '2'], ['9호선', '종합운동장역', '2'], ['9호선', '삼전역', '3'], ['9호선', '석촌고분역', '2'], ['9호선', '석촌역', '2'],
                ['9호선', '송파나루역', '4'], ['9호선', '한성백제역', '2'], ['9호선', '올림픽공원역', '3'], ['9호선', '둔촌오륜역', '2'], ['9호선', '중앙보훈병원역', '2'], ['신분당선', '강남역', ''],
                ['신분당선', '양재역', '2'], ['신분당선', '양재시민의숲역', '2'], ['신분당선', '청계산입구역', '3'], ['수인분당선', '청량리역', ''], ['수인분당선', '왕십리역', '8'], ['수인분당선', '서울숲역', '3'],
                ['수인분당선', '압구정로데오역', '2'], ['수인분당선', '강남구청역', '3'], ['수인분당선', '선정릉역', '1'], ['수인분당선', '선릉역', '2'], ['수인분당선', '한티역', '2'], ['수인분당선', '도곡역', '2'],
                ['수인분당선', '구룡역', '1'], ['수인분당선', '개포동역', '2'], ['수인분당선', '대모산입구역', '2'], ['수인분당선', '수서역', '4'], ['수인분당선', '복정역', '3'], ['경의중앙선', '수색역', ''],
                ['경의중앙선', '디지털미디어시티역', '2'], ['경의중앙선', '가좌역', '2'], ['경의중앙선', '홍대입구역', '3'], ['경의중앙선', '서강대역', '2'], ['경의중앙선', '공덕역', '3'], ['경의중앙선', '효창공원앞역', '3'],
                ['경의중앙선', '용산역', '6'], ['경의중앙선', '이촌역', '4'], ['경의중앙선', '서빙고역', '2'], ['경의중앙선', '한남역', '3'], ['경의중앙선', '옥수역', '3'], ['경의중앙선', '응봉역', '2'],
                ['경의중앙선', '왕십리역', '3'], ['경의중앙선', '청량리역', '4'], ['경의중앙선', '회기역', '4'], ['경의중앙선', '중랑역', '3'], ['경의중앙선', '상봉역', '2'], ['경의중앙선', '망우역', '7'],
                ['경의중앙선', '양원역', '2'], ['공항철도', '서울역', ''], ['공항철도', '공덕역', '5'], ['공항철도', '홍대입구역', '3'], ['공항철도', '디지털미디어시티역', '5'], ['공항철도', '마곡나루역', '7'],
                ['공항철도', '김포공항역', '4'], ['우이신설선', '북한산우이역', ''], ['우이신설선', '솔밭공원역', '2'], ['우이신설선', '4.19민주묘지역', '1'], ['우이신설선', '가오리역', '2'], ['우이신설선', '화계역', '2'],
                ['우이신설선', '삼양역', '1'], ['우이신설선', '삼양사거리역', '2'], ['우이신설선', '솔샘역', '2'], ['우이신설선', '북한산보국문역', '2'], ['우이신설선', '정릉역', '3'], ['우이신설선', '성신여대입구역', '2'],
                ['우이신설선', '보문역', '2'], ['우이신설선', '신설동역', '1']]



station_api_key = 'KakaoAK 2923b1b707b4bddd84bbc07c7bb3f14a'
my_api_key = unquote('bhQZulxZSz%2FeMsDseMe2DSccTVB%2BQPnxTxDp4SrK7HYRP%2BS0YDiBn93FLz0d%2FMFbyMPUqAvaMqrtW4e9%2FnHYhA%3D%3D')

class StationGps:

    def get_near_station_gps(self, gps_x, gps_y):

        gps_x_list = []
        gps_y_list = []
        name_list = []
        distance = []

        url = 'https://dapi.kakao.com/v2/local/search/keyword.json'
        queryParams = '?' + urlencode({quote_plus('page'): '1',
                                       quote_plus('size'): '15',
                                       quote_plus('sort'): 'distance',
                                       quote_plus('category_group_code'): 'SW8',
                                       quote_plus('x'): gps_x,
                                       quote_plus('y'): gps_y,
                                       quote_plus('radius'): '700',
                                       quote_plus('query'): 'station'})

        header = {'Authorization': station_api_key}
        response = requests.get(url, headers=header, params=queryParams)
        station_dict= json.loads(response.text)

        for vals_dict in station_dict['documents']:
            name_list.append(vals_dict['place_name'])
            distance.append(vals_dict['distance'])

        return name_list, distance

    def get_station_gps(self, station):

        url = 'https://dapi.kakao.com/v2/local/search/keyword.json'
        queryParams = '?' + urlencode({quote_plus('page'): '1',
                                       quote_plus('size'): '15',
                                       quote_plus('sort'): 'accuracy',
                                       quote_plus('category_group_code'): 'SW8',
                                       quote_plus('query'): station})

        header = {'Authorization': station_api_key}
        response = requests.get(url, headers=header, params=queryParams)
        station_dict = json.loads(response.text)

        for vals_dict in station_dict['documents']:
            if station == vals_dict['place_name']:
                gps_x = vals_dict['x']
                gps_y = vals_dict['y']

        return gps_x, gps_y



class SubwayPathData:

    def subway_path(self, start_x, start_y, end_x, end_y):

        url = 'http://ws.bus.go.kr/api/rest/pathinfo/getPathInfoBySubway'

        queryParams = '?' + urlencode({quote_plus('ServiceKey'): my_api_key,
                                       quote_plus('startX'): start_x,
                                       quote_plus('startY'): start_y,
                                       quote_plus('endX'): end_x,
                                       quote_plus('endY'): end_y})

        response = requests.get(url + queryParams).text.encode('utf-8')
        xmlobj = bs4.BeautifulSoup(response, 'lxml-xml')
        itemList_tag = xmlobj.findAll('itemList')

        for item_tag in itemList_tag:

            # 지하철 타고 환승 없이 가는 경로의 시간을 찾는 경우이므로 환승 횟수가 1인 경우를 검색
            pathList_tag = item_tag.find_all('pathList')

            if len(pathList_tag) == 1 :
                time = item_tag.find('time').text

        return time


class SubwayDestination:

    def __init__(self, gps_x, gps_y, time):

        self.gps_x = gps_x
        self.gps_y = gps_y
        self.time = time

    def result_sub_station(self):

        result_gps = []
        name_list = []
        distance = []
        result_station = []
        cnt = 1
        tmp_time = 0

        stt_gps = StationGps()
        name_list, distance = stt_gps.get_near_station_gps(self.gps_x, self.gps_y)

        for i, distance in enumerate(distance):
            # 목적지에서 지하철역까지 거리를 성인 평균 보행 속도 67m/s 를 나누어 지하철역까지의 보행시간 계산
            self.time = self.time - int(distance)/67
            station_name = name_list[i].split()[0]
            station_route = name_list[i].split()[1]
            print('입력 지하철역 : ' + station_name, ' ', station_route)

            for j, sub in enumerate(subway_route):
                if station_name in sub and station_route == sub[0]:
                    #아래방향으로 지하철역 확인
                    while(True):
                        if j+cnt >= len(subway_route):
                            cnt = 1
                            tmp_time = 0
                            break
                        # 도착 지하철역 까지의 시간이 처음 입력된 시간을 초과하기 전에 break
                        if subway_route[j+cnt][2] == '':
                            subway_route[j + cnt][2] = 0
                        if tmp_time + int(subway_route[j+cnt][2]) > self.time:
                            if subway_route[j][0] == subway_route[j + cnt][0]:
                                # 같은 지하철 노선인지 확인 후 추가
                                result_station.append(subway_route[j+cnt][1] + ' ' + subway_route[j+cnt][0])
                            cnt = 1
                            tmp_time = 0
                            break
                        else:
                            tmp_time += int(subway_route[j+cnt][2])
                            cnt += 1

                    # 위방향으로 지하철역 확인
                    while (True):
                        if j-cnt < 0:
                            cnt = 1
                            tmp_time = 0
                            break
                        # 도착 지하철역 까지의 시간이 처음 입력된 시간을 초과하기 전에 break
                        if tmp_time + int(subway_route[j-cnt+1][2]) > self.time:
                            if subway_route[j][0] == subway_route[j - cnt][0]:
                                # 같은 지하철 노선인지 확인 후 추가
                                result_station.append(subway_route[j-cnt][1] + ' ' + subway_route[j-cnt][0])
                            cnt = 1
                            tmp_time = 0
                            break
                        else:
                            tmp_time += int(subway_route[j-cnt+1][2])
                            cnt += 1

        for stt in result_station:
            gps_x, gps_y = StationGps().get_station_gps(stt)
            result_gps.append([gps_x, gps_y])

        return  result_gps, result_station, station_name



if __name__ == '__main__':


    sub, stt = SubwayDestination(127.0816985, 37.5642135, 20)
    print(sub.result_sub_station())
